[
  {
    "id": 1,
    "title": "National Institute of Health Research",
    "info": "We are proud to collaborate with the National Institute of Health Research (NIHR) on an innovative and impactful research project. This project, funded by the NIHR, is focused on trialling a musculoskeletal health application, ‘FLX Health,’ specifically within a population of individuals who have experienced brain injuries.\n\nThe primary goal of this trial is to evaluate the effectiveness of the FLX Health app in supporting musculoskeletal recovery and improving physical outcomes for individuals facing unique rehabilitation challenges following brain injury. By leveraging this technology, the study aims to provide valuable insights into how digital health solutions can complement traditional rehabilitation methods, enhance patient engagement, and lead to improved long-term health outcomes.\n\nThis collaboration reflects our commitment to advancing evidence-based practices and integrating cutting-edge technology into healthcare, ultimately seeking to empower individuals with brain injuries to take control of their recovery journey."
  },
  {
    "id": 2,
    "title": "United Kingdom Research Innovation (UKRI)",
    "info": "We are honoured to have received two significant grants from UK Research and Innovation (UKRI), supporting our efforts to advance healthcare technology innovation.\n\nCurrently, we are working on a Biomedical Catalyst Grant, which is focused on the development and design of wireframes for a Patient Portal application to accompany our Kompass platform. This portal will serve as a critical tool, enhancing patient engagement by providing a streamlined, user-friendly interface for managing health data, tracking progress, and communicating with healthcare providers. Our work on this project aims to improve patient experience and outcomes by integrating technology into the healthcare journey.\n\nPreviously, we received grant funding through the UKRI following the founder of Kompass being awarded the prestigious Women in Innovation award. This grant supported the development of a comprehensive Data Dashboard for the Kompass platform. The dashboard has enabled healthcare providers and researchers to access and analyse critical health data more efficiently, empowering informed decision-making and enhancing the overall impact of the Kompass platform.\n\nOur collaboration with UKRI underscores our commitment to innovation in the healthcare sector and our vision to leverage technology to improve patient outcomes and healthcare delivery."
  },
  {
    "id": 3,
    "title": "European Regional Development Fund (ERDF) and Health Innovation Manchester (HiM)",
    "info": "We are grateful for the support provided by the European Regional Development Fund (ERDF) and Health Innovation Manchester (HiM), which has been instrumental in enabling the deployment of our Kompass platform within an NHS stroke service. This funding has allowed us to explore the potential of the Kompass app in a real-world healthcare setting, specifically targeting stroke patients.\n\nThe objective of this initiative is to assess how the Kompass app can enhance patient care, rehabilitation, and long-term health outcomes within the NHS. By integrating the app into stroke services, we are investigating its role in improving patient engagement, streamlining care pathways, and supporting recovery through personalized health insights and self-management tools.\n\nThis collaboration highlights our commitment to transforming healthcare through innovation and digital solutions, as well as our dedication to enhancing the care provided to stroke patients in the NHS."
  },
  {
    "id": 4,
    "title": "Salford Royal NHS Foundation Trust",
    "info": "Kompass partnered with Salford Royal NHS Foundation Trust to conduct a comprehensive service-wide audit, focusing on the implementation and testing of the Kompass Data Dashboard. This collaboration aimed to evaluate the dashboard’s effectiveness in streamlining administrative tasks and improving overall operational efficiency within the Trust.\n\nThrough this audit, we explored how the Data Dashboard could enhance data management, reduce manual processes, and support better decision-making by providing real-time insights into patient data and service performance. By harnessing the power of technology, this initiative demonstrated the potential of digital tools to significantly reduce administrative burdens while improving service delivery.\n\nThis partnership with Salford Royal NHS Foundation Trust reflects our shared vision of integrating innovative digital solutions into healthcare systems to improve both clinical outcomes and operational workflows."
  }
]
